In [1]:
from pandas import Series

In [2]:
da1 = {'ron':29,'kelly':20,'ham':39}

In [3]:
da2 =Series(da1)

In [4]:
da2

ron      29
kelly    20
ham      39
dtype: int64

In [5]:
da2['ron']

29

In [6]:
from pandas import DataFrame

In [7]:
dic1 = {'name':['tyler','brown','percy','roxy'],'Age':[23,32,44,21],'percentage':[43,56,78,67]}

In [8]:
x = DataFrame(dic1)

In [9]:
x

    name  Age  percentage
0  tyler   23          43
1  brown   32          56
2  percy   44          78
3   roxy   21          67

In [10]:
x.loc[1]

name          brown
Age              32
percentage       56
Name: 1, dtype: object

In [11]:
x.T

                0      1      2     3
name        tyler  brown  percy  roxy
Age            23     32     44    21
percentage     43     56     78    67

In [13]:
x.sort_values('percentage')

    name  Age  percentage
0  tyler   23          43
1  brown   32          56
3   roxy   21          67
2  percy   44          78

In [15]:
x.sort_values('Age')

    name  Age  percentage
3   roxy   21          67
0  tyler   23          43
1  brown   32          56
2  percy   44          78

In [16]:
x.sort_index()

    name  Age  percentage
0  tyler   23          43
1  brown   32          56
2  percy   44          78
3   roxy   21          67

In [17]:
da2

ron      29
kelly    20
ham      39
dtype: int64

In [19]:
da2.sort_values()

kelly    20
ron      29
ham      39
dtype: int64

In [20]:
x.sum()

name          tylerbrownpercyroxy
Age                           120
percentage                    244
dtype: object

In [22]:
x.sum(axis = 1)

0     66
1     88
2    122
3     88
dtype: int64